//------------------------------------------------------------------------------
// fish.cpp - содержит функции обработки рыбы
//------------------------------------------------------------------------------

#include "fish.h"

// Ввод параметров рыбы из потока
void In(fish& f, ifstream& ifst) {
    ifst >> f.name >> f.weight;
}

// Случайный ввод значения веса рыбы
void InRnd(fish& f) {
    f.weight = Random();

}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Out(fish& f, ofstream& ofst) {
    ofst << "It is Fish: name = "
        << f.name << ", weight = " << f.weight
        << ". Division = " << Division(f) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление частного от деления суммы кодов незашифрованной строки на вес рыбы
double Division(fish& f) {
   string name = f.name;
   int sum;
   for (int i = 0; i < name.size(); i++) {
       sum += int(name[i]);
   }
    return double(sum / f.weight);
}